ErpTest/src/AccumulationRegisters/уатЗаказыГрузоотправителей/уатЗаказыГрузоотправителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатЗаказыГрузоотправителей</name>
  <comment>(уат)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказГрузоотправителя</name>
    <comment>Только родительский грузы (не этапы)</comment>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/уатТипыТочекМаршрута/уатТипыТочекМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыТочекМаршрута</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйПункт</name>
  </enumValues>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/уатМаршрутныйЛист/уатМаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатМаршрутныйЛист</name>
  <comment>(уат)</comment>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <registerRecords>AccumulationRegister.уатЗаказыГрузоотправителей</registerRecords>
  <registerRecords>AccumulationRegister.уатОборотыПоМаршрутномуЛисту</registerRecords>
  <attributes>
    <name>АдресНазначения</name>
    <comment>Адрес прибытия</comment>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправления</name>
    <comment>Адрес отправления</comment>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <comment>Суммарный вес груза, кг</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.уатВидыОперацийМаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель1</name>
    <comment>Водитель 1</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель2</name>
    <comment>Водитель 2</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВПути</name>
    <comment>Время в пути по маршрутному листу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяВыполнения</name>
    <comment>Дата выполнения фактическая</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяОтправления</name>
    <comment>Дата отправления фактическая</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяОтправленияПлан</name>
    <comment>Плановое время отправления</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <comment>Общее количество мест</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <comment>Объем перевезенного груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Пользователь, ответственный за документ</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <comment>Протяженность маршрута, км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник1</name>
    <comment>Сотрудник 1</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник2</name>
    <comment>Сотрудник 2</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>GUIDСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <comment>Вес груза в кг</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <comment>Удалить</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПоЗаказу</name>
      <comment>Единица измерения по заказу на ТС</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказГрузоотправителя</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>Количество мест</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Перевозимый груз</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <comment>Объем груза в м3</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрибытиеПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрибытиеФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоянка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТочкиМаршрута</name>
      <type>
        <types>EnumRef.уатТипыТочекМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>УбытиеФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/уатЗаказыГрузоотправителей/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Перем МетаданныеДокумента, МетаданныеТабЧасти, ИмяДокумента, ИмяТабличнойЧасти, ИмяТаблицы, СтруктураШапкиДокумента, Отказ, Заголовок; 

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
// 
Процедура ВыполнитьПриход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;

	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = текСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	Записать();
	
КонецПроцедуры

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;
	
	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = ТекСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	// запись движений
	Записать();
	
КонецПроцедуры

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект - объект проводимого документа, 
//  Параметры      - структура, содержащая значения параметров необходимых для контроля остатков
//  Отказ          - флаг отказа в проведении,
//  Заголовок      - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабЧасти, СтруктураШапки, ОтказПроведения, ЗаголовокСообщения) Экспорт
	
	Если ИмяТабЧасти <> "" Тогда  
		Если ДокументОбъект[ИмяТабЧасти].Количество()=0 Тогда //если в таб.части ничего нет - не надо проверять
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ИмяТабличнойЧасти 		= ИмяТабЧасти;
	Отказ 					= ОтказПроведения;
   	СтруктураШапкиДокумента = СтруктураШапки;
	Заголовок 				= ЗаголовокСообщения;


	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;

	Если ИмяТабЧасти <>"" Тогда
		ИмяТаблицы = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	Иначе
		ИмяТаблицы = ИмяДокумента;
	КонецЕсли;

	Если ИмяТабЧасти <>"" Тогда
		МетаданныеТабЧасти       = МетаданныеДокумента.ТабличныеЧасти[ИмяТабЧасти];
	КонецЕсли;

	Если ИмяДокумента = "уатМаршрутныйЛист" Тогда
		КонтрольОстатков_МаршрутныйЛист(ДокументОбъект);
	Иначе
		Сообщить("Для документа "+ДокументОбъект+" не предусмотрен вызов процедуры 'Контроль остатков' модуля регистра 'Заказы на ТС'");
	КонецЕсли;
	
	ОтказПроведения = Отказ;
    ЗаголовокСообщения = Заголовок;

КонецПроцедуры // КонтрольОстатков()

Процедура КонтрольОстатков_МаршрутныйЛист(ДокументОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МаршрутныйЛист.ЗаказГрузоотправителя								КАК ЗаказНаТС,
	|	МаршрутныйЛист.Номенклатура 							КАК Номенклатура,
	|	МаршрутныйЛист.КоличествоВЕдиницеХраненияОстатков 		КАК КоличествоДокументЕдХрОстатков,   	//количество по документу в единице измерения остатков
	|	МаршрутныйЛист.Количество 								КАК КоличествоДокумент, 				//количество в единице измерения документа
	|	МаршрутныйЛист.ЕдиницаИзмерения							КАК ЕдиницаИзмеренияДокумент,
	|	ЕстьNULL(уатЗаказыНаТСОстатки.КоличествоОстаток, 0)		КАК КоличествоОстатокЗаказ,			// остаток по заказу в единице хранения остатков  
	|	ЕстьNULL(уатЗаказыНаТСОстатки.ЕдиницаИзмерения, МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу) КАК ЕдиницаИзмеренияЗаказ,
	|	МаршрутныйЛист.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХраненияОстатков
	|ИЗ
	|	(ВЫБРАТЬ
	|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя 				 КАК ЗаказГрузоотправителя,
	|		уатМаршрутныйЛистЗаказы.Номенклатура 		 КАК Номенклатура,
	|		СУММА(уатМаршрутныйЛистЗаказы.Количество) 	 КАК Количество,         
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения 	 КАК ЕдиницаИзмерения,
	|		ЕстьNULL(СУММА(ВЫРАЗИТЬ(уатМаршрутныйЛистЗаказы.Количество КАК Число(15,3))), 0) *
	|		ВЫБОР КОГДА уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
	|		КОНЕЦ КАК КоличествоВЕдиницеХраненияОстатков,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу КАК ЕдиницаИзмеренияПоЗаказу
	|	ИЗ
	|		Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
	|	ГДЕ
	|		уатМаршрутныйЛистЗаказы.Ссылка = &СсылкаМаршрутныйЛист
	|		И уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута = &ТипТочкиМаршрутаРазгрузка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя,
	|		уатМаршрутныйЛистЗаказы.Номенклатура,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу
	|   ) КАК МаршрутныйЛист
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(&Момент, ) КАК уатЗаказыНаТСОстатки
	|		ПО МаршрутныйЛист.ЗаказГрузоотправителя.Контрагент = уатЗаказыНаТСОстатки.Контрагент
	|			И МаршрутныйЛист.ЗаказГрузоотправителя = уатЗаказыНаТСОстатки.ЗаказГрузоотправителя
	|			И МаршрутныйЛист.Номенклатура = уатЗаказыНаТСОстатки.Номенклатура
	|			И МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу = уатЗаказыНаТСОстатки.ЕдиницаИзмерения";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения",
			"уатМаршрутныйЛистЗаказы.Номенклатура"));
			
	Запрос.УстановитьПараметр("Момент",						ДокументОбъект.МоментВремени());
	Запрос.УстановитьПараметр("СсылкаМаршрутныйЛист",		ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТипТочкиМаршрутаРазгрузка",  Перечисления.уатТипыТочекМаршрута.Разгрузка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокаСообщения = "";
	Пока Выборка.Следующий() цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоПревышение = Выборка.КоличествоДокументЕдХрОстатков - Выборка.КоличествоОстатокЗаказ; //превышение в единице хранения остатков
		Если КоличествоПревышение > 0 Тогда
			СтрокаСообщения = "" + Символы.Таб + "Превышение списываемого количества для: '" + Выборка.ЗаказНаТС + "' по номенклатуре: '" + Выборка.Номенклатура  + "'.
				|"; 
			СтрокаСообщения = СтрокаСообщения
				+ "Превышение: " + КоличествоПревышение	+ " " + Выборка.ЕдиницаХраненияОстатков + "; "
				+ "Неразвезенный остаток: " + Выборка.КоличествоОстатокЗаказ + " " + Выборка.ЕдиницаХраненияОстатков + "; "
				+ "Количество по документу: " + Выборка.КоличествоДокумент + " " + Выборка.ЕдиницаИзмеренияДокумент + " ("
					+ Выборка.КоличествоДокумент + " " + ?(Выборка.ЕдиницаИзмеренияЗаказ = Неопределено, "",
					Выборка.ЕдиницаИзмеренияЗаказ.Наименование) + ").";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
